In [2]:
import pandas as pd

## Desafio 1

#### Carregando dados

In [28]:
data = pd.read_json('data.json')
data.head()

   nome  idade                                          enderecos
0  João     28  {'tipo': 'casa', 'rua': 'Rua A', 'numero': 123...
1  João     28  {'tipo': 'trabalho', 'rua': 'Rua B', 'numero':...

#### Transformando dados

In [29]:
import json

with open('data.json') as dt:
    data_brute = json.load(dt)

In [30]:
data_normalize = pd.json_normalize(data_brute, record_path='enderecos', meta=['nome','idade'])

In [31]:
data_normalize

       tipo    rua  numero          cidade   nome idade
0      casa  Rua A     123      SÃ£o Paulo  JoÃ£o    28
1  trabalho  Rua B     456  Rio de Janeiro  JoÃ£o    28

## Desafio 2

In [4]:
dados_ =pd.read_json('data_.json')

In [5]:
dados_

                                             pessoas
0  {'nome': 'João', 'idade': '25', 'endereco': {'...
1  {'nome': 'Maria', 'idade': 30, 'endereco': {'r...

#### Transformando dados

In [6]:
import json

with open('data_.json') as dt:
    data_brute = json.load(dt)

In [9]:
dados_normalizados = pd.json_normalize(data_brute, record_path='pessoas')

In [10]:
dados_normalizados

,nome,idade,telefones,endereco.rua,endereco.numero,endereco.cidade
0,JoÃ£o,25,"[11 1111-1111, 11 2222-2222]",Rua A,123,SÃ£o Paulo
1,Maria,30,[21 3333-3333],,456,Rio de Janeiro

#### Fazendo o cast das colunas

In [11]:
dados_normalizados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   nome             2 non-null      object
 1   idade            2 non-null      object
 2   telefones        2 non-null      object
 3   endereco.rua     2 non-null      object
 4   endereco.numero  2 non-null      int64
 5   endereco.cidade  2 non-null      object
dtypes: int64(1), object(5)
memory usage: 228.0+ bytes

In [14]:
dados_normalizados['idade'] = dados_normalizados['idade'].astype('int32')

In [15]:
dados_normalizados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   nome             2 non-null      object
 1   idade            2 non-null      int32
 2   telefones        2 non-null      object
 3   endereco.rua     2 non-null      object
 4   endereco.numero  2 non-null      int64
 5   endereco.cidade  2 non-null      object
dtypes: int32(1), int64(1), object(4)
memory usage: 220.0+ bytes

#### Realizando o filtro e remoção dos dados com valores vazios

In [18]:
dados_filtrado = dados_normalizados.query("`endereco.rua` != ''")

In [19]:
dados_filtrado

,nome,idade,telefones,endereco.rua,endereco.numero,endereco.cidade
0,JoÃ£o,25,"[11 1111-1111, 11 2222-2222]",Rua A,123,SÃ£o Paulo